### NAME OMAR HASSAN MOHAMED 
#### TASK 1 IN SQL

In [2]:
import sqlite3

In [3]:
# Create connection
con = sqlite3.connect("company.db")
cursor = con.cursor()

In [ ]:
#  Create tables
cursor.execute('''CREATE TABLE IF NOT EXISTS mangers (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    department_id INTEGER NOT NULL,
    FOREIGN KEY(department_id) REFERENCES departments(id)
)''')

cursor.execute('''CREATE TABLE IF NOT EXISTS  employees  (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    first_name TEXT,
    last_name TEXT,
    salary INTEGER,
    manger_id INTEGER NOT NULL ,
    department_id INTEGER NOT NULL,
    FOREIGN KEY(manger_id) REFERENCES mangers(id),
    FOREIGN KEY(department_id) REFERENCES departments(id)
)''')

cursor.execute('''CREATE TABLE IF NOT EXISTS departments (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL
)''')

In [6]:
# samle data 
employees = [
    ("omar","hassan",5000,100,1050),
    ("emad","mohsen",2500,110,1030),
    ("ali","gomaa",3000,150,1020),
    ("sara"," amr ",4000,200,1080),
    ("gamal","hegazy",3500,300,1060),
    ("jana","ammar",2500,250,1070),
    ("seif","ali",5000,350,1010)
]


departments=[
    (1050,"HR"),
    (1030,"Operations"),
    (1020,"Quality"),
    (1080,"Logistics"),
    (1060," IT "),
    (1070,"Product Management"),
    (1010,"Customer Service")
]

mangers=[
    (100,"mosaad",1050),
    (110,"ismael",1030),
    (150,"yousef",1020),
    (200,"hytham",1080),
    (300,"omar",1060),
    (250,"ali ",1070),
    (350,"amr",1010)
]

In [8]:
# insert samle data 
cursor.executemany('INSERT INTO employees (first_name, last_name, salary,manger_id,department_id ) VALUES (?, ?, ? , ? , ?)', employees )


cursor.executemany('INSERT INTO mangers (id, name , department_id ) VALUES (?, ?, ?)', mangers )

cursor.executemany('INSERT INTO departments (id, name  ) VALUES (?, ?)', departments )

con.commit()

In [9]:
# Select all employees
cursor.execute("SELECT * FROM employees")

#Fetch All Data 
print(cursor.fetchall())

[(1, 'omar', 'hassan', 5000, 100, 1050), (2, 'emad', 'mohsen', 2500, 110, 1030), (3, 'ali', 'gomaa', 3000, 150, 1020), (4, 'sara', ' amr ', 4000, 200, 1080), (5, 'gamal', 'hegazy', 3500, 300, 1060), (6, 'jana', 'ammar', 2500, 250, 1070), (7, 'seif', 'ali', 5000, 350, 1010)]

In [10]:
# Select all employees
cursor.execute("SELECT * FROM mangers")

#Fetch All Data 
print(cursor.fetchall())

[(100, 'mosaad', 1050), (110, 'ismael', 1030), (150, 'yousef', 1020), (200, 'hytham', 1080), (250, 'ali ', 1070), (300, 'omar', 1060), (350, 'amr', 1010)]

##### Question 1: 
Write a SQL query to retrieve the emp_id, last_name, and salary of employees whose salary is 
between 2,000 and 5,000 and do not have a manager ID of 101 or 200. 
Instructions: 
1. Use the SELECT statement to specify the columns: emp_id, last_name, and salary. 
2. Filter the results using the WHERE clause with the BETWEEN operator to set the salary range. 
3. Use the NOT IN clause to exclude certain manager IDs. 
4. Combine conditions using the AND logical operator.

In [4]:
cursor.execute( ''' SELECT id , last_name , salary , manger_id
                FROM employees 
                WHERE salary BETWEEN 2000 AND 5000
                AND manger_id NOT IN (101,200)
''' )
data = cursor.fetchall()
for row in data :
    print(row)

(1, 'hassan', 5000, 100)
(2, 'mohsen', 2500, 110)
(3, 'gomaa', 3000, 150)
(5, 'hegazy', 3500, 300)
(6, 'ammar', 2500, 250)
(7, 'ali', 5000, 350)

##### Question 2: 
Write a SQL query to display the employee names along with their respective department names. 
Use aliases for table names for better readability. 
Instructions: 
1. Use the SELECT statement to specify the columns: employee.name and department.name. 
2. Use the FROM clause to include the tables employees and departments. 
3. Use an INNER JOIN to connect the employees and departments tables based on the 
department IDs. 
4. Use table aliases (e.g., e for employees, d for departments) to shorten the table names in the 
query. 
5. Order the results by department name in ascending order.

In [5]:
cursor.execute( ''' SELECT d.name as department_name,
                e.first_name AS employ_name 
                FROM departments d 
                JOIN employees e ON d.id = e.department_id
                GROUP BY d.name
                ORDER BY d.name 
''' )
data = cursor.fetchall()
for row in data :
    print(row)

(' IT ', 'gamal')
('Customer Service', 'seif')
('HR', 'omar')
('Logistics', 'sara')
('Operations', 'emad')
('Product Management', 'jana')
('Quality', 'ali')

##### Question 3: 
Write a SQL query to find the number of employees and the average salary for each department. 
Ensure that the results are grouped by department ID. 
Instructions: 
1. Use the SELECT statement to specify the department ID, the count of employees, and the 
average salary. 
2. Use the GROUP BY clause to group the results by department ID. 
3. Use the COUNT() function to find the number of employees in each department. 
4. Use the AVG() function to calculate the average salary in each department.

In [9]:
cursor.execute( ''' SELECT d.id  ,
                COUNT(e.id) ,
                AVG(salary)
                FROM departments d
                JOIN employees e ON e.department_id = d.id 
                GROUP BY d.id
''' )

data = cursor.fetchall()
for row in data :
    print(row)

(1010, 1, 5000.0)
(1020, 1, 3000.0)
(1030, 1, 2500.0)
(1050, 1, 5000.0)
(1060, 1, 3500.0)
(1070, 1, 2500.0)
(1080, 1, 4000.0)